# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import pandas as pd
import sqlite3

In [3]:
conn= sqlite3.connect('data.sqlite')
c= conn.cursor()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [9]:
#Your code here
c.execute('''select lastName, firstName, city
            from employees e
            join customers c
            on e.employeeNumber = c.SalesRepEmployeeNumber
            where city = 'Boston'
            ;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

    lastName firstName    city
0  Patterson     Steve  Boston
1   Firrelli     Julie  Boston

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [21]:
#Your code here
c.execute('''select * from employees
            join offices
            using (officeCode)
            ;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
len(df)

23

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

In [ ]:
# Your code here
c.execute('''select from;''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
df

## Level Up: Display the names of each product each employee has sold

In [43]:
# Your code here
c.execute('''select firstName, lastName, productName 
                from employees e
                join customers c
                on e.employeeNumber = c.SalesRepEmployeeNumber
                join orders
                using(customerNumber)
                join orderDetails
                using(orderNumber)
                join products
                using(productCode)
                ''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
print(len(df))
df.head()

2996

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [44]:
#Your code here
df['fullName'] = df.groupby([0],[1]).count()

TypeError: unhashable type: 'list'

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!